Revit 2027 API
PDFExportOptions.ColorDepth Property
 Color depth of either black/white, gray scale or color.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ColorDepthType ColorDepth { get; set; }
Public Property ColorDepth As ColorDepthType
	Get
	Set
public:
property ColorDepthType ColorDepth {
	ColorDepthType get ();
	void set (ColorDepthType value);
}
member ColorDepth : ColorDepthType with get, set
Property Value
ColorDepthType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PDFExportOptions Class
Autodesk.Revit.DB Namespace